# 코드가 6으로 나누어떨어질 때 전선을 자른다.
# 즉, 주어진 코드를 숫자로 바꾸어야함.
# 2자리 이상, 8자리 이하.

numbers=[['***', '* *', '* *', '* *', '***'],
        ['  *', '  *', '  *', '  *', '  *'],
        ['***', '  *', '***', '*  ', '***'],
        ['***', '  *', '***', '  *', '***'],
        ['* *', '* *', '***', '  *', '  *'],
        ['***', '*  ', '***', '  *', '***'],
        ['***', '*  ', '***', '* *', '***'],
        ['***', '  *', '  *', '  *', '  *'],
        ['***', '* *', '***', '* *', '***'],
        ['***', '* *', '***', '  *', '***']]

# 문자열 입력받아서 담기
code = []
for i in range(5):
    line = input()
    code.append(line)
    
# 비교해서 숫자 만들기
real_code = ''
for j in range(0, len(code[0]) - 2, 4):
    num = []
    for i in range(5):
        num.append(code[i][j:j+3])
    for i in range(len(numbers)):
        if numbers[i] == num:
            real_code += str(i)

if int(real_code) % 6 == 0:
    print('BEER!!')
else:
    print('BOOM!!')
    